{
  "_instructions": "Add your work experience here. Copy the experience object for each job.",
  "sectionTitle": "Work Experience",
  "experiences": [
    {
      "title": "Research Assistant",
      "company": "University of Texas at Arlington",
      "period": "May 2025 - Present",
      "location": "",
      "description": "Migrated the site from Jekyll to Next.js 14 (TypeScript, Tailwind CSS),built a responsive UI and converted YAML content to typed JSON. Implemented Team/News/Publications as structured, filterable sections with dynamic lists. Set up GitHub to Vercel CI/CD,enforced ESLint and enabled Vercel Analytics.",
      "responsibilities": []
    },
    {
      "title": "Full Stack Developer",
      "company": "Gangavathiexports, Remote",
      "period": "Jan 2024 - June 2024",
      "location": "",
      "description": "Automated Magento Open Source installation on Ubuntu using Ansible and configured SMTP for custom domain emails, reducing deployment time by 75%. Integrated a mobile-friendly theme, updated user content, and helped customers create configurable product listings improving inventory management efficiency by 40%. Integrated a secure payment gateway and SEO best practices to improve search engine visibility and drive organic traffic.",
      "responsibilities": []
    },
    {
      "title": "Software Developer Intern",
      "company": "Maruti Constructions, India",
      "period": "Sep 2021 - Aug 2022",
      "location": "",
      "description": "Developed and deployed a machine learning system using Linear Regression algorithms to analyze historical real estate data, achieving 92% prediction accuracy and reducing estimation time by 75%. Engineered robust data preprocessing pipelines with outlier detection and feature engineering, improving model performance by 38%. Architected a scalable Flask RESTful API with efficient endpoints and caching mechanisms for real-time price predictions during peak traffic periods.",
      "responsibilities": []
    }
  ]
}
